Autodesk.Revit.UI.Selection.SelElementSet.Create
Creates a new instance of a set specifically for holding selected elements.
Returns: Returns a new Element Set.
Remarks: If the user wants to change the selected Element with the API, the instance SelElementSet
must be created to do the operation of Add and Remove.

Autodesk.Revit.UI.Selection.SelElementSet.Erase(Autodesk.Revit.DB.Element)
Remove an element from the selected element set.
element: The element to be removed.
Returns: Returns count of the elements to be erased from the selected element set.
Remarks: This function will do same task as Remove.

Autodesk.Revit.UI.Selection.SelElementSet.Clear
Clear the selected element set.
Remarks: All the elements in the selected element set will be removed and no element will be highlighted
after the operation.

Autodesk.Revit.UI.Selection.SelElementSet.Remove(Autodesk.Revit.DB.Element)
Remove an element from the selected element set.
element: The element to be removed.
Remarks: This function will remove the specified from the selected element set, just like de-select it
from the UI.

Autodesk.Revit.UI.Selection.SelElementSet.Add(Autodesk.Revit.DB.Element)
Add an element into the selected element set.
element: The element to be added.
Remarks: This function will add the specified element to the selected element set, just like the element
is picked from the UI.

Autodesk.Revit.UI.Selection.SelElementSet
This class contains the current user selection of elements within the project.
Remarks: Add or Remove elements from the selected element set. The elements in the set will be highlighted
as selected elements in the UI.